{
    "id": "isa",
    "name": "Архитектура информационных систем",
    "start": "01.09",
    "milestones": [
        {
            "name": "Контроль раздела 1",
            "description": "",
            "week": 5,
            "points": 10,
            "requirenments": [
                {
                    "name": "Интервьюирование",
                    "week": 2
                },
                {
                    "name": "Требования к системе",
                    "week": 3
                },
                {
                    "name": "Тестовые случаи",
                    "week": 3
                },
                {
                    "name": "Диаграммы Use Case",
                    "week": 4
                },
                {
                    "name": "Диаграммы BPMN",
                    "week": 4
                }
            ]
        },
        {
            "name": "Контроль раздела 2",
            "description": "",
            "week": 8,
            "points": 10,
            "requirenments": [
                {
                    "name": "Диаграмма классов / функциональное описание",
                    "week": 6
                },
                {
                    "name": "Оценка трудозатрат",
                    "week": 6
                },
                {
                    "name": "Реализация бизнес-объектов",
                    "week": 7
                },
                {
                    "name": "Модульные тесты",
                    "week": 7
                }
            ]
        },
        {
            "name": "Контроль раздела 3",
            "description": "",
            "week": 10,
            "points": 15,
            "requirenments": [
                {
                    "name": "Бизнес-компонент",
                    "week": 9
                },
                {
                    "name": "Интеграционные тесты",
                    "week": 9
                }
            ]
        },
        {
            "name": "Контроль раздела 4",
            "description": "",
            "week": 16,
            "points": 15,
            "requirenments": [
                {
                    "name": "Расширение приложения 1",
                    "week": 12
                },
                {
                    "name": "Расширение приложения 2",
                    "week": 14
                },
                {
                    "name": "Расширение приложения 3",
                    "week": 15
                }
            ]
        }
    ],
    "domains": [
        {
            "id": "Library",
            "name": "Библиотека",
            "description": "Организация занимается хранением печатных произведений для общественного пользования. Произведения хранятся как в письменном, так и в электронном виде. Читатели библиотеки могут брать литературу для временного пользования в читальном зале, либо на дом.",
            "areas": [
                {
                    "id": "Issues",
                    "name": "Читальный фонд",
                    "description": "Управление читальным фондом подразумевает закупку новых изданий и списание старых."
                },
                {
                    "id": "LiteratureProviding",
                    "name": "Выдача литературы",
                    "description": "Библиотека предоставляет произведения из читального фонда во временное пользование своим абонентам. Имеются условия и ограничения."
                }
            ]
        },
        {
            "id": "Institute",
            "name": "Институт",
            "description": "Организация осуществляет подготовку бакалавров, магистров и аспирантов по ряду различных направлений. Имеется несколько филиалов, расположенных в разных городах. Помимо образовательной деятельности, также осуществляется и научная.",
            "areas": [
                {
                    "id": "Students",
                    "name": "Учет учащихся",
                    "description": "Институт ведет учет учащихся, их принадлежность к учебным группам и подразделениям."
                },
                {
                    "id": "Personnel",
                    "name": "Учет персонала",
                    "description": "Сотрудники отдела кадров ведут учет персонала института, их должностей, научных званий и степеней, сроков контрактов и т.п."
                },
                {
                    "id": "StudentAccountability",
                    "name": "Учет успеваемости",
                    "description": "Сотрудники института ведут учет успеваемости студентов, определяя могут ли студенты продолжить обучения по итогам контрольных мероприятий, могут ли они претендовать на материальное стимулирование и т.д."
                },
                {
                    "id": "EducationProcess",
                    "name": "Учебный процесс",
                    "description": "Во время учебного процесса преподаватели фиксируют посещаемость и полученные студентами оценки на занятиях и контрольных мероприятиях в соответствии с программами курсов."
                }
            ]
        },
        {
            "id": "Retail",
            "name": "Сеть продуктовых магазинов",
            "description": "Организация осуществляет реализацию продуктовых товаров через сеть торговых точек. Торговые точки представляют собой магазины розничной торговли с открытым торговым залом. Каждый магазин имеет собственный склад.",
            "areas": [
                {
                    "id": "Stock",
                    "name": "Склад",
                    "description": "Сотрудники склада осуществляют учет товаров, их условий и сроков храниния. Периодически они осуществляют инвентаризацию, списывая испортившиеся продукты."
                },
                {
                    "id": "Space",
                    "name": "Торговый зал",
                    "description": "Сотрудники торгового зала ответственны за выставление товаров в соответствующие слоты, а также за обновление цен."
                },
                {
                    "id": "Checkout",
                    "name": "Касса",
                    "description": "Кассиры отвечают за реализацию товаров покупателям и за операции возврата."
                },
                {
                    "id": "Suppliers",
                    "name": "Поставки товаров",
                    "description": "Сотрудники отдела обеспечения ответственны за работу с поставщиками: договорные отношения, сроки и условия поставок и т.д."
                },
                {
                    "id": "Customers",
                    "name": "Отношения с покупателями",
                    "description": "Сотрудники отдела по работе с покупателями ответственны за разработку мер по привлечению покупателей, а также за работу с их обращениями."
                },
                {
                    "id": "Pricing",
                    "name": "Ценообразование",
                    "description": "Сотрудники отдела ценообразования отвечают за формирование отпускных цен на товары с учетом связанных с их реализацией расходов."
                },
                {
                    "id": "Personnel",
                    "name": "Управление персоналом",
                    "description": "Сотрудники отдела управления персоналом ведут учет сотрудников организации, их мест работы, должностей. Они ответственны за ведение графика отпусков и составление расписания смен."
                }
            ]
        }
    ]
}